app/controllers/tasks_controller.rb

  def index
    @tasks = Task.select {|task| task.user_id == current_user.id}
---
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)
    @task.user_id = current_user.id
    if @task.save
---
INSERT INTO "tasks" ("title", "due_date", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "talk to Frank"], ["due_date", Wed, 03 May 2017], ["description", "He needs a chat"], ["created_at", 2017-05-14 12:23:48 UTC], ["updated_at", 2017-05-14 12:23:48 UTC], ["user_id", 3]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["title", "Go shopping"], ["description", "Go to Leiden market"], ["updated_at", 2017-05-14 15:17:39 UTC], ["id", 9]]