app/controllers/users/registrations_controller.rb

INSERT INTO "tasks" ("title", "due_date", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Sign up"], ["due_date", Tue, 16 May 2017], ["description", "Complete!"], ["created_at", 2017-05-15 09:16:20 UTC], ["updated_at", 2017-05-15 09:16:20 UTC], ["user_id", 5]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "ian@gmail.com"], ["encrypted_password", "$2a$11$/2gmhD.5zL8PPnyC3ro.cOIJRD/Qr77tXFScT9gilto2LLWn72N3e"], ["created_at", 2017-05-15 09:16:20 UTC], ["updated_at", 2017-05-15 09:16:20 UTC]]
---
  def create
    super
    Task.create(title: 'Sign up', due_date: Date.tomorrow, description: 'Complete!', user_id: current_user.id)